---
type: FilterRule
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# FilterRule

`Autodesk.Revit.DB.FilterRule` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | ElementPasses | 2011 | `public bool ElementPasses ( Element element )` |
| Method | GetRuleParameter | 2019 | `public ElementId GetRuleParameter ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |